n = int(input())
m = int(input())
sum = 0
a = []
sum1 = 0
for i in range(n, 0, -1):
    sum1 += i
    if sum + i > m:
        continue
    sum += i
    a.append(i)
if sum1 < m:
    print(0)
else:
    print(*a, sep="\n")
"""
Задача 3. Заказ в магазине
Ограничение по времени: 0.5 секунд
Решив запастись ручками на весь новый учебный год, Игорь подсчитал, что ему нужно M ручек.
В его любимом интернет-магазине есть удобная функция — он может сразу добавить в заказ
упаковку из любого числа ручек от 1 до N. Правда, оказалось, что нельзя добавить в заказ две
упаковки одного размера. Например, если Игорю нужно купить M = 12 ручек, а максимальное
число ручек в упаковке N = 10, то Игорь может добавить в заказ упаковку из 7 ручек и упаковку
из 5 ручек, но не сможет добавить две упаковки из 6 ручек.
Сформируйте заказ на M ручек, используя минимальное число различных упаковок.
Формат входных данных
Первая строка входных данных содержит число N — максимальный размер одной упаковки
(1 6 N 6 109
). Вторая строка входных данных содержит целое число M — необходимое количество
ручек в заказе (1 6 M 6 109
).
Формат выходных данных
Программа должна вывести одно или несколько чисел от 1 до N — размеры выбранных упаковок
в любом порядке. Есть имеется несколько возможных решений, то выведите любое из них. Если
решения не существует, необходимо вывести одно число «0».
"""